Table of Contents
 Class IdeaConnectedMember
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaConnectedMember : AbstractIdeaObject<IIdeaConnectedMember>, IEquatable<AbstractIdeaObject<IIdeaConnectedMember>>, IIdeaConnectedMember, IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaConnectedMember>
IdeaConnectedMember
Implements
IEquatable<AbstractIdeaObject<IIdeaConnectedMember>>
IIdeaConnectedMember
IIdeaObjectConnectable
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaConnectedMember>.Id
 AbstractIdeaObject<IIdeaConnectedMember>.Name
 AbstractIdeaObject<IIdeaConnectedMember>.Identifier
 AbstractIdeaObject<IIdeaConnectedMember>.GetHashCode()
 AbstractIdeaObject<IIdeaConnectedMember>.Equals(object)
 AbstractIdeaObject<IIdeaConnectedMember>.Equals(AbstractIdeaObject<IIdeaConnectedMember>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaConnectedMember(Identifier<IIdeaConnectedMember>)
public IdeaConnectedMember(Identifier<IIdeaConnectedMember> identifier)
Parameters
identifier Identifier<IIdeaConnectedMember>
 IdeaConnectedMember(string)
public IdeaConnectedMember(string id)
Parameters
id string
Properties
 AutoAddCutByWorkplane
Add automatically cut by work plane on beginning and end of member
public bool AutoAddCutByWorkplane { get; set; }
Property Value
bool
 ConnectedMemberType
Connected member type [Structural|Stiffening|Negative]
public IdeaConnectedMemberType ConnectedMemberType { get; set; }
Property Value
IdeaConnectedMemberType
 ForcesIn
Load forces placed in
public IdeaForcesIn ForcesIn { get; set; }
Property Value
IdeaForcesIn
 GeometricalType
Member is [Continuous|Ended]
public IdeaGeometricalType GeometricalType { get; set; }
Property Value
IdeaGeometricalType
 IdeaMember
member
public IIdeaMember1D IdeaMember { get; set; }
Property Value
IIdeaMember1D
 IsBearing
Is member bearing?
public bool IsBearing { get; set; }
Property Value
bool
 IsReferenceLineInCenterOfGravity
Is Cross section place on reference line or center of gravity - affected member offsets
public bool IsReferenceLineInCenterOfGravity { get; set; }
Property Value
bool
 MemberSegmentType
Member segment type
public IdeaBeamSegmentModelType MemberSegmentType { get; set; }
Property Value
IdeaBeamSegmentModelType
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public IIdeaPersistenceToken Token { get; }
Property Value
IIdeaPersistenceToken
 Edit this page